In [ ]:
import numpy as np
import pandas as pd

## Concat

In [ ]:
df1=pd.DataFrame({'Name' : pd.Series(['An', 'Hoa', 'Trung','Huy'],index=['NV1','NV2','NV3','NV4']),
      'Age' : pd.Series([15, 22, 36,27],index=['NV1','NV2','NV3','NV4'])
         })
df2 = pd.DataFrame({'Name' : pd.Series(['Thanh','Chuyen'], index=['NV11','NV12']),
      'Age' : pd.Series([26,47],index=['NV11','NV12']),
      'Address':pd.Series(['HCM','HN'],index=['NV11','NV12']) 
         })
print(df1)
print(df2)

      Name  Age
NV1     An   15
NV2    Hoa   22
NV3  Trung   36
NV4    Huy   27
        Name  Age Address
NV11   Thanh   26     HCM
NV12  Chuyen   47      HN

In [ ]:
# Gộp dữ liệu
df=pd.concat([df1,df2],sort=False)
df

        Name  Age Address
NV1       An   15     NaN
NV2      Hoa   22     NaN
NV3    Trung   36     NaN
NV4      Huy   27     NaN
NV11   Thanh   26     HCM
NV12  Chuyen   47      HN

In [ ]:
# Gộp dữ liệu theo cột
df=pd.concat([df1,df2],sort=False,axis=1)
df

       Name   Age    Name   Age Address
NV1      An  15.0     NaN   NaN     NaN
NV2     Hoa  22.0     NaN   NaN     NaN
NV3   Trung  36.0     NaN   NaN     NaN
NV4     Huy  27.0     NaN   NaN     NaN
NV11    NaN   NaN   Thanh  26.0     HCM
NV12    NaN   NaN  Chuyen  47.0      HN

In [ ]:
# Gộp dữ liệu, dùng tham số join
df3=pd.DataFrame({'Name' : pd.Series(['Hoang', 'Thuy'],index=['NV1','NV12']),
      'Age' : pd.Series([15, 22],index=['NV1','NV12']),
      'Salary': pd.Series([1500, 2700],index=['NV1','NV12'])
         })

print(df1)
print(df3)
pd.concat([df1,df3],sort=False,join="outer")

      Name  Age
NV1     An   15
NV2    Hoa   22
NV3  Trung   36
NV4    Huy   27
       Name  Age  Salary
NV1   Hoang   15    1500
NV12   Thuy   22    2700

       Name  Age  Salary
NV1      An   15     NaN
NV2     Hoa   22     NaN
NV3   Trung   36     NaN
NV4     Huy   27     NaN
NV1   Hoang   15  1500.0
NV12   Thuy   22  2700.0

## Append

In [ ]:
df1=pd.DataFrame({'Name' : pd.Series(['An', 'Hoa', 'Trung','Huy'],index=['NV1','NV2','NV3','NV4']),
      'Age' : pd.Series([15, 22, 36,27],index=['NV1','NV2','NV3','NV4'])
         })
df2 = pd.DataFrame({'Name' : pd.Series(['Thanh','Chuyen'], index=['NV11','NV12']),
      'Age' : pd.Series([26,47],index=['NV11','NV12']),
      'Address':pd.Series(['HCM','HN'],index=['NV11','NV12']) 
         })
print(df1)
print(df2)
print(df1.append(df2,sort=False))

      Name  Age
NV1     An   15
NV2    Hoa   22
NV3  Trung   36
NV4    Huy   27
        Name  Age Address
NV11   Thanh   26     HCM
NV12  Chuyen   47      HN
        Name  Age Address
NV1       An   15     NaN
NV2      Hoa   22     NaN
NV3    Trung   36     NaN
NV4      Huy   27     NaN
NV11   Thanh   26     HCM
NV12  Chuyen   47      HN

## Merge

In [ ]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'], 
                   'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})

df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                   'hire_date': [2004, 2008, 2012, 2014]})

print(df1)
print(df2)
df3=pd.merge(df1,df2)
print(df3)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

### Merge many - to - one

In [ ]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
'supervisor': ['Carly', 'Guido', 'Steve']})

print(df3)
print(df4)
print(pd.merge(df3,df4))

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve
  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

### Merge many - to - many

In [ ]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting', 'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux','spreadsheets', 'organization']})

print(df1)
print(df5)
print(pd.merge(df1,df5))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization
  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

### Merge - xác định tên cột

In [ ]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'], 
                   'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})

df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})

print(df1)
print(df3)
print(pd.merge(df1,df3,left_on="employee",right_on="name"))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000
  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

### Merge theo index

In [ ]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'], 
                   'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})

df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
df1.set_index('employee')
df3.set_index('name')
print(pd.merge(df1,df3,left_index=True,right_index=True))

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

### Merge - tham số how

In [ ]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'], 
                   'group': ['Accounting', 'Engineering', '', 'HR']})
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR', 'R&D'],
                   'supervisor': ['Carly', 'Guido', 'Steve','Tom']})

print(df1)
print(df4)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa
3      Sue           HR
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve
3          R&D        Tom

In [ ]:
print(pd.merge(df1,df4,how="inner"))

  employee        group supervisor
0      Bob   Accounting      Carly
1     Jake  Engineering      Guido
2      Sue           HR      Steve

In [ ]:
print(pd.merge(df1,df4,how="outer"))

  employee        group supervisor
0      Bob   Accounting      Carly
1     Jake  Engineering      Guido
2     Lisa                     NaN
3      Sue           HR      Steve
4      NaN          R&D        Tom

In [ ]:
print(pd.merge(df1,df4,how="left"))

  employee        group supervisor
0      Bob   Accounting      Carly
1     Jake  Engineering      Guido
2     Lisa                     NaN
3      Sue           HR      Steve

In [ ]:
print(pd.merge(df1,df4,how="right"))

  employee        group supervisor
0      Bob   Accounting      Carly
1     Jake  Engineering      Guido
2      Sue           HR      Steve
3      NaN          R&D        Tom